OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
#if defined(ENABLE_DEBUG) && !defined(ENABLE_DEBUG_WEB)
#undef ENABLE_DEBUG
#endif

#include <Arduino.h>
#include <Update.h>
#include "certificates.h"

#include <string>

typedef const __FlashStringHelper *fstr_t;

#ifdef ESP32

#include <WiFi.h>

#elif defined(ESP8266)

#include <ESP8266WiFi.h>

#else
#error Platform not supported
#endif

//#include <FS.h>                       // SPIFFS file-system: store web server html, CSS etc.
#include <LittleFS.h>

#include "emonesp.h"
#include "web_server.h"
#ifdef ENABLE_TSDB
#include "tsdb_energy_logger.h"
#endif
#include "web_server_static.h"
#include "app_config.h"
#include "net_manager.h"
#include "mqtt.h"
#include "ocpp.h"
#include "input.h"
#include "emoncms.h"
#include "divert.h"
#include "lcd.h"
#include "espal.h"
#include "time_man.h"
#include "tesla_client.h"
#include "scheduler.h"
#include "rfid.h"
#include "current_shaper.h"
#include "home_battery.h"
#include "evse_man.h"
#include "limit.h"
#include "web_auth.h"
#include "web_auth_secret.h"

MongooseHttpServer server;          // Create class for Web server
MongooseHttpServer redirect;        // Server to redirect to HTTPS if enabled

bool enableCors = false;
bool streamDebug = false;

// Event timeouts
static unsigned long wifiRestartTime = 0;
static unsigned long apOffTime = 0;

// Content Types
const char _CONTENT_TYPE_HTML[]     PROGMEM = "text/html";
const char _CONTENT_TYPE_TEXT[]     PROGMEM = "text/plain";
const char _CONTENT_TYPE_CSS[]      PROGMEM = "text/css";
const char _CONTENT_TYPE_JSON[]     PROGMEM = "application/json";
const char _CONTENT_TYPE_JS[]       PROGMEM = "text/javascript";
const char _CONTENT_TYPE_JPEG[]     PROGMEM = "image/jpeg";
const char _CONTENT_TYPE_PNG[]      PROGMEM = "image/png";
const char _CONTENT_TYPE_SVG[]      PROGMEM = "image/svg+xml";
const char _CONTENT_TYPE_ICO[]      PROGMEM = "image/vnd.microsoft.icon";
const char _CONTENT_TYPE_WOFF[]     PROGMEM = "font/woff";
const char _CONTENT_TYPE_WOFF2[]    PROGMEM = "font/woff2";
const char _CONTENT_TYPE_MANIFEST[] PROGMEM = "application/manifest+json";

#define RAPI_RESPONSE_BLOCKED             -300

void handleConfig(MongooseHttpServerRequest *request);
void handleEvseClaimsTarget(MongooseHttpServerRequest *request);
void handleEvseClaims(MongooseHttpServerRequest *request);
void handleEventLogs(MongooseHttpServerRequest *request);
void handleCertificates(MongooseHttpServerRequest *request);

void handleUpdateRequest(MongooseHttpServerRequest *request);
size_t handleUpdateUpload(MongooseHttpServerRequest *request, int ev, MongooseString filename, uint64_t index, uint8_t *data, size_t len);
void handleUpdateClose(MongooseHttpServerRequest *request);

void handleMigrateExpand16mb(MongooseHttpServerRequest *request);
void handleMigrateStatus(MongooseHttpServerRequest *request);
void handleMigrateCoredump(MongooseHttpServerRequest *request);

void handleTime(MongooseHttpServerRequest *request);
void handleTimePost(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *response);
void handleMqttAction(MongooseHttpServerRequest *request);

#ifndef ENABLE_TSDB
void handleEnergyRaw(MongooseHttpServerRequest *request);
void handleEnergyDaily(MongooseHttpServerRequest *request);
void handleEnergyMonthly(MongooseHttpServerRequest *request);
void handleEnergyAnnual(MongooseHttpServerRequest *request);
#else // ENABLE_TSDB
void handleEnergyRaw(MongooseHttpServerRequest *request);
void handleEnergyDaily(MongooseHttpServerRequest *request);
void handleEnergyWeekly(MongooseHttpServerRequest *request);
void handleEnergyMonthly(MongooseHttpServerRequest *request);
void handleEnergyAnnual(MongooseHttpServerRequest *request);
#endif // ENABLE_TSDB

void dumpRequest(MongooseHttpServerRequest *request)
{
#ifdef ENABLE_DEBUG_WEB_REQUEST
  DBUGF("host.length = %d", request->host().length());
  DBUGF("host.c_str = %p", request->host().c_str());
  DBUGF("uri.length = %d", request->uri().length());
  DBUGF("uri.c_str = %p", request->uri().c_str());

  if(request->method() == HTTP_GET) {
    DBUG("GET");
  } else if(request->method() == HTTP_POST) {
    DBUG("POST");
  } else if(request->method() == HTTP_DELETE) {
    DBUG("DELETE");
  } else if(request->method() == HTTP_PUT) {
    DBUG("PUT");
  } else if(request->method() == HTTP_PATCH) {
    DBUG("PATCH");
  } else if(request->method() == HTTP_HEAD) {
    DBUG("HEAD");
  } else if(request->method() == HTTP_OPTIONS) {
    DBUG("OPTIONS");
  } else {
    DBUG("UNKNOWN");
  }
  DBUGF(" http://%.*s%.*s",
    request->host().length(), request->host().c_str(),
    request->uri().length(), request->uri().c_str());

  if(request->contentLength()){
    DBUGF("_CONTENT_TYPE: %.*s", request->contentType().length(), request->contentType().c_str());
    DBUGF("_CONTENT_LENGTH: %u", request->contentLength());
  }

  int headers = request->headers();
  int i;
  for(i=0; i<headers; i++) {
    DBUGF("_HEADER[%.*s]: %.*s",
      request->headerNames(i).length(), request->headerNames(i).c_str(),
      request->headerValues(i).length(), request->headerValues(i).c_str());
  }

  /*
  int params = request->params();
  for(i = 0; i < params; i++) {
    AsyncWebParameter* p = request->getParam(i);
    if(p->isFile()){
      DBUGF("_FILE[%s]: %s, size: %u", p->name().c_str(), p->value().c_str(), p->size());
    } else if(p->isPost()){
      DBUGF("_POST[%s]: %s", p->name().c_str(), p->value().c_str());
    } else {
      DBUGF("_GET[%s]: %s", p->name().c_str(), p->value().c_str());
    }
  }
  */
#endif
}

// -------------------------------------------------------------------
// Constant-time credential comparison
//
// Compares two NUL-terminated strings without an early exit on the first
// differing byte, so the time taken does not leak how many leading bytes
// matched (CWE-208). The length difference is folded in so a length mismatch
// does not short-circuit either. Not a substitute for a slow hash, but removes
// the trivial byte-by-byte timing signal from Basic-auth checks.
// -------------------------------------------------------------------
static bool credentialsMatch(const char *a, const char *b)
{
  size_t la = strlen(a);
  size_t lb = strlen(b);
  // Keep the length difference full-width: truncating to a narrow type could
  // fold a length delta that is a nonzero multiple of the type's range to 0 and
  // (with matching overlapping bytes) false-accept.
  size_t diff = la ^ lb;
  size_t n = la < lb ? la : lb;
  for(size_t i = 0; i < n; i++) {
    diff |= (unsigned char)(a[i] ^ b[i]);
  }
  return 0 == diff;
}

// -------------------------------------------------------------------
// Session-cookie auth helper (browser UI)
//
// Extracts the oevse_session cookie from the request, verifies its HMAC
// signature and expiry against the current secret, and returns true when
// the cookie is valid.  File-local; consumed by isAuthenticated() below
// and the login handler (Task 7).
// -------------------------------------------------------------------
static bool hasValidSessionCookie(MongooseHttpServerRequest *request)
{
  MongooseString cookieHdr = request->headers("Cookie");
  if(!cookieHdr) {
    return false;
  }
  std::string tok = cookie_extract(
    std::string(cookieHdr.c_str(), cookieHdr.length()), "oevse_session");
  if(tok.empty()) {
    return false;
  }
  return session_token_verify(
    std::string(web_auth_get_secret().c_str()), tok, (uint32_t)time(nullptr));
}

// -------------------------------------------------------------------
// Single source of truth for HTTP authentication
//
// Used by both the REST path (requestPreProcess) and the WebSocket handshake
// gate (onWsAuthenticate). Returns true when the request is permitted:
//  - AP-only provisioning mode (captive portal, before credentials are set), or
//  - no admin credentials configured, or
//  - a valid Basic Authorization header (machine clients: HA, MQTT, app), or
//  - a valid session cookie (browser UI).
// Parsing reuses the library's tested Basic-auth parser; only the comparison is
// swapped for a constant-time one.
// -------------------------------------------------------------------
bool isAuthenticated(MongooseHttpServerRequest *request)
{
  if(net.isWifiModeApOnly() || www_username == "") {
    return true;
  }

