OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
  // Basic auth (machine clients: HA, MQTT, app, scripts)
  MongooseString authHeader = request->headers("Authorization");
  if(authHeader) {
    mg_str hdr = authHeader.toMgStr();
    char user_buf[64] = {0};
    char pass_buf[64] = {0};
    if(0 == mg_parse_http_basic_auth(&hdr, user_buf, sizeof(user_buf),
                                     pass_buf, sizeof(pass_buf)) &&
       credentialsMatch(www_username.c_str(), user_buf) &&
       credentialsMatch(www_password.c_str(), pass_buf)) {
      return true;
    }
  }

  // Session cookie (browser UI)
  return hasValidSessionCookie(request);
}

// -------------------------------------------------------------------
// POST /login  — credential check + session cookie mint
// POST /logout — session cookie clear
//
// Both handlers build their own response and intentionally do NOT call
// requestPreProcess / isAuthenticated: an unauthenticated user must be
// able to reach /login, and /logout should always succeed.
// -------------------------------------------------------------------
static const uint32_t REMEMBER_TTL = 2592000; // 30 days
static const uint32_t SESSION_TTL  = 21600;   // 6 hours

// Login brute-force lockout state (volatile, single-user model)
static uint8_t  s_loginFails = 0;
static uint32_t s_lockUntil  = 0;

static uint32_t backoffSeconds(uint8_t fails) {
  if(fails < 5) return 0;
  if(fails >= 10) return 900;       // 30<<5 already exceeds the cap; avoids shift UB
  uint32_t s = 30u << (fails - 5);  // fails 5..9 -> 30,60,120,240,480
  return s > 900 ? 900 : s;
}

void handleLogin(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response = request->beginResponseStream();
  response->setContentType(CONTENT_TYPE_JSON);

  if(HTTP_POST != request->method()) {
    response->setCode(405);
    request->send(response);
    return;
  }

  uint32_t now = (uint32_t)time(nullptr);
  if(now < s_lockUntil) {
    response->setCode(429);
    response->print(F("{\"msg\":\"locked\"}"));
    request->send(response);
    return;
  }

  String body = request->body().toString();
  DynamicJsonDocument doc(512);
  if(deserializeJson(doc, body)) {
    response->setCode(400);
    response->print(F("{\"msg\":\"bad json\"}"));
    request->send(response);
    return;
  }

  String user = doc["user"] | "";
  String pass = doc["pass"] | "";
  bool remember = doc["remember"] | false;

  bool ok = auth_constant_time_equals(std::string(user.c_str()), std::string(www_username.c_str())) &&
            auth_constant_time_equals(std::string(pass.c_str()), std::string(www_password.c_str()));
  if(!ok) {
    if(s_loginFails < 255) s_loginFails++;
    uint32_t bo = backoffSeconds(s_loginFails);
    if(bo) s_lockUntil = now + bo;
    response->setCode(401);
    response->print(F("{\"msg\":\"invalid\"}"));
    request->send(response);
    return;
  }

  s_loginFails = 0;
  s_lockUntil  = 0;
  uint32_t exp = now + (remember ? REMEMBER_TTL : SESSION_TTL);
  std::string token = session_token_mint(std::string(web_auth_get_secret().c_str()), exp);

  String cookie = "oevse_session=";
  cookie += token.c_str();
  cookie += "; Path=/; HttpOnly; SameSite=Strict";
  if(remember) { cookie += "; Max-Age="; cookie += String(REMEMBER_TTL); }
  // if(tls_active()) cookie += "; Secure";   // add when TLS status is known
  response->addHeader(F("Set-Cookie"), cookie.c_str());
  response->setCode(200);
  response->print(F("{\"msg\":\"ok\"}"));
  request->send(response);
}

void handleLogout(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response = request->beginResponseStream();
  response->setContentType(CONTENT_TYPE_JSON);
  if(HTTP_POST != request->method()) { response->setCode(405); request->send(response); return; }
  response->addHeader(F("Set-Cookie"), F("oevse_session=; Path=/; HttpOnly; SameSite=Strict; Max-Age=0"));
  response->setCode(200);
  response->print(F("{\"msg\":\"ok\"}"));
  request->send(response);
}

// -------------------------------------------------------------------
// Helper function to perform the standard operations on a request
// -------------------------------------------------------------------
bool requestPreProcess(MongooseHttpServerRequest *request, MongooseHttpServerResponseStream *&response, fstr_t contentType)
{
  dumpRequest(request);

  if(!isAuthenticated(request)) {
    request->requestAuthentication(esp_hostname);
    return false;
  }

  response = request->beginResponseStream();
  response->setContentType(contentType);

  if(enableCors) {
    response->addHeader(F("Access-Control-Allow-Origin"), F("*"));
    response->addHeader(F("Access-Control-Allow-Headers"), F("*"));
    response->addHeader(F("Access-Control-Allow-Methods"), F("*"));
  }

  response->addHeader(F("Cache-Control"), F("no-cache, private, no-store, must-revalidate, max-stale=0, post-check=0, pre-check=0"));

  return true;
}

// -------------------------------------------------------------------
// Helper function to detect positive string
// -------------------------------------------------------------------
bool isPositive(const String &str) {
  return str == "1" || str == "true";
}

bool isPositive(MongooseHttpServerRequest *request, const char *param) {
  char paramValue[8];
  int paramFound = request->getParam(param, paramValue, sizeof(paramValue));
  return paramFound >= 0 && (0 == paramFound || isPositive(String(paramValue)));
}

//---------------------------------------------------------------------
// Build status data
// --------------------------------------------------------------------

void buildStatus(DynamicJsonDocument &doc) {

  // Get the current time
  struct timeval local_time;
  gettimeofday(&local_time, NULL);

  struct tm * timeinfo = gmtime(&local_time.tv_sec);

  char time[64];
  char offset[8];
  strftime(time, sizeof(time), "%FT%TZ", timeinfo);
  strftime(offset, sizeof(offset), "%z", timeinfo);

  if (net.isWiredConnected()) {
    doc["mode"] = "Wired";
  } else if (net.isWifiModeStaOnly()) {
    doc["mode"] = "STA";
  } else if (net.isWifiModeApOnly()) {
    doc["mode"] = "AP";
  } else if (net.isWifiModeAp() && net.isWifiModeSta()) {
    doc["mode"] = "STA+AP";
  }

  doc["wifi_client_connected"] = (int)net.isWifiClientConnected();
  doc["eth_connected"] = (int)net.isWiredConnected();
  doc["net_connected"] = (int)net.isWifiClientConnected();
  doc["ipaddress"] = net.getIp();
  doc["ipv6address"] = net.getIpv6();
  doc["macaddress"] = net.getMac();

